In [2]:
import pandas as pd

data = pd.read_csv('train.csv')
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
# 처음 n줄 출력, default = 5
data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [9]:
data['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [11]:
s = data['Pclass'].value_counts()
s.sort_index()

1    216
2    184
3    491
Name: Pclass, dtype: int64

In [12]:
s.sort_index(ascending=False)

3    491
2    184
1    216
Name: Pclass, dtype: int64

In [13]:
data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [16]:
age_mean = data['Age'].mean()
age_mean

29.69911764705882

In [17]:
data['Survived'] == 0

0       True
1      False
2      False
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: Survived, Length: 891, dtype: bool

In [24]:
dead = data[data.Survived == 0]
survived = data[data.Survived == 1]
print(dead, len(dead))
print(survived, len(survived))

     PassengerId  Survived  Pclass                                      Name  \
0              1         0       3                   Braund, Mr. Owen Harris
4              5         0       3                  Allen, Mr. William Henry
5              6         0       3                          Moran, Mr. James
6              7         0       1                   McCarthy, Mr. Timothy J
7              8         0       3            Palsson, Master. Gosta Leonard
..           ...       ...     ...                                       ...
884          885         0       3                    Sutehall, Mr. Henry Jr
885          886         0       3      Rice, Mrs. William (Margaret Norton)
886          887         0       2                     Montvila, Rev. Juozas
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch           Ticket     Fare Cabin Embarked
0      male  22.0      1      0        A/5 21171   7.2500   NaN        S
4      male  35.0      0      0           373450   8.0500   NaN        S
5      male   NaN      0      0           330877   8.4583   NaN        Q
6      male  54.0      0      0            17463  51.8625   E46        S
7      male   2.0      3      1           349909  21.0750   NaN        S
..      ...   ...    ...    ...              ...      ...   ...      ...
884    male  25.0      0      0  SOTON/OQ 392076   7.0500   NaN        S
885  female  39.0      0      5           382652  29.1250   NaN        Q
886    male  27.0      0      0           211536  13.0000   NaN        S
888  female   NaN      1      2       W./C. 6607  23.4500   NaN        S
890    male  32.0      0      0           370376   7.7500   NaN        Q

[549 rows x 12 columns] 549
     PassengerId  Survived  Pclass  \
1              2         1       1
2              3         1       3
3              4         1       1
8              9         1       3
9             10         1       2
..           ...       ...     ...
875          876         1       3
879          880         1       1
880          881         1       2
887          888         1       1
889          890         1       1

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
..                                                 ...     ...   ...    ...
875                   Najib, Miss. Adele Kiamie "Jane"  female  15.0      0
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  female  56.0      0
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
889                              Behr, Mr. Karl Howell    male  26.0      0

     Parch            Ticket     Fare Cabin Embarked
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
8        2            347742  11.1333   NaN        S
9        0            237736  30.0708   NaN        C
..     ...               ...      ...   ...      ...
875      0              2667   7.2250   NaN        C
879      1             11767  83.1583   C50        C
880      1            230433  26.0000   NaN        S
887      0            112053  30.0000   B42        S
889      0            111369  30.0000  C148        C

[342 rows x 12 columns] 342

In [26]:
female = data[data.Sex == 'female']
female, len(female)

(     PassengerId  Survived  Pclass  \
 1              2         1       1
 2              3         1       3
 3              4         1       1
 8              9         1       3
 9             10         1       2
 ..           ...       ...     ...
 880          881         1       2
 882          883         0       3
 885          886         0       3
 887          888         1       1
 888          889         0       3

                                                   Name     Sex   Age  SibSp  \
 1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
 2                               Heikkinen, Miss. Laina  female  26.0      0
 3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
 8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
 9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
 ..                                                 ...     ...   ...    ...
 880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
 882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
 885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
 887                       Graham, Miss. Margaret Edith  female  19.0      0
 888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1

      Parch            Ticket     Fare Cabin Embarked
 1        0          PC 17599  71.2833   C85        C
 2        0  STON/O2. 3101282   7.9250   NaN        S
 3        0            113803  53.1000  C123        S
 8        2            347742  11.1333   NaN        S
 9        0            237736  30.0708   NaN        C
 ..     ...               ...      ...   ...      ...
 880      1            230433  26.0000   NaN        S
 882      0              7552  10.5167   NaN        S
 885      5            382652  29.1250   NaN        Q
 887      0            112053  30.0000   B42        S
 888      2        W./C. 6607  23.4500   NaN        S

 [314 rows x 12 columns],
 314)

In [28]:
survivedChildren = data[(data.Survived == 1) & (data.Age <= 17)]
children = data[(data.Age <= 17)]
print(len(survivedChildren), len(children), len(survivedChildren) / len(children) * 100)

61 113 53.98230088495575

In [30]:
boy = data[(data.Age < 18) & (data.Sex == 'male')]
print(boy, len(boy))

     PassengerId  Survived  Pclass  \
7              8         0       3
16            17         0       3
50            51         0       3
59            60         0       3
63            64         0       3
78            79         1       2
86            87         0       3
125          126         1       3
138          139         0       3
163          164         0       3
164          165         0       3
165          166         1       3
171          172         0       3
182          183         0       3
183          184         1       2
193          194         1       2
220          221         1       3
261          262         1       3
266          267         0       3
278          279         0       3
282          283         0       3
305          306         1       1
333          334         0       3
340          341         1       2
348          349         1       3
352          353         0       3
386          387         0       3
407          408         1       2
433          434         0       3
445          446         1       1
480          481         0       3
489          490         1       3
500          501         0       3
532          533         0       3
549          550         1       2
550          551         1       1
574          575         0       3
683          684         0       3
686          687         0       3
721          722         0       3
731          732         0       3
746          747         0       3
751          752         1       3
755          756         1       2
764          765         0       3
787          788         0       3
788          789         1       3
791          792         0       2
802          803         1       1
803          804         1       3
819          820         0       3
824          825         0       3
827          828         1       2
831          832         1       2
841          842         0       2
844          845         0       3
850          851         0       3
869          870         1       3

                                                Name   Sex    Age  SibSp  \
7                     Palsson, Master. Gosta Leonard  male   2.00      3
16                              Rice, Master. Eugene  male   2.00      4
50                        Panula, Master. Juha Niilo  male   7.00      4
59                Goodwin, Master. William Frederick  male  11.00      5
63                             Skoog, Master. Harald  male   4.00      3
78                     Caldwell, Master. Alden Gates  male   0.83      0
86                            Ford, Mr. William Neal  male  16.00      1
125                     Nicola-Yarred, Master. Elias  male  12.00      1
138                              Osen, Mr. Olaf Elon  male  16.00      0
163                                  Calic, Mr. Jovo  male  17.00      0
164                     Panula, Master. Eino Viljami  male   1.00      4
165  Goldsmith, Master. Frank John William "Frankie"  male   9.00      0
171                             Rice, Master. Arthur  male   4.00      4
182            Asplund, Master. Clarence Gustaf Hugo  male   9.00      4
183                        Becker, Master. Richard F  male   1.00      2
193                       Navratil, Master. Michel M  male   3.00      1
220                   Sunderland, Mr. Victor Francis  male  16.00      0
261                Asplund, Master. Edvin Rojj Felix  male   3.00      4
266                        Panula, Mr. Ernesti Arvid  male  16.00      4
278                               Rice, Master. Eric  male   7.00      4
282                        de Pelsmaeker, Mr. Alfons  male  16.00      0
305                   Allison, Master. Hudson Trevor  male   0.92      1
333                  Vander Planke, Mr. Leo Edmondus  male  16.00      2
340                   Navratil, Master. Edmond Roger  male   2.00      1
348           Coutts, Master. William Loch "William"  male   3.00      1
352                               Elias, Mr. Tannous  male  15.00      1
386                  Goodwin, Master. Sidney Leonard  male   1.00      5
407                   Richards, Master. William Rowe  male   3.00      1
433                       Kallio, Mr. Nikolai Erland  male  17.00      0
445                        Dodge, Master. Washington  male   4.00      0
480                   Goodwin, Master. Harold Victor  male   9.00      5
489            Coutts, Master. Eden Leslie "Neville"  male   9.00      1
500                                 Calic, Mr. Petar  male  17.00      0
532                             Elias, Mr. Joseph Jr  male  17.00      1
549                   Davies, Master. John Morgan Jr  male   8.00      1
550                      Thayer, Mr. John Borland Jr  male  17.00      0
574                     Rush, Mr. Alfred George John  male  16.00      0
683                      Goodwin, Mr. Charles Edward  male  14.00      5
686                         Panula, Mr. Jaako Arnold  male  14.00      4
721                        Jensen, Mr. Svend Lauritz  male  17.00      1
731                         Hassan, Mr. Houssein G N  male  11.00      0
746                      Abbott, Mr. Rossmore Edward  male  16.00      1
751                              Moor, Master. Meier  male   6.00      0
755                        Hamalainen, Master. Viljo  male   0.67      1
764                           Eklund, Mr. Hans Linus  male  16.00      0
787                        Rice, Master. George Hugh  male   8.00      4
788                       Dean, Master. Bertram Vere  male   1.00      1
791                              Gaskell, Mr. Alfred  male  16.00      0
802              Carter, Master. William Thornton II  male  11.00      1
803                  Thomas, Master. Assad Alexander  male   0.42      0
819                     Skoog, Master. Karl Thorsten  male  10.00      3
824                     Panula, Master. Urho Abraham  male   2.00      4
827                            Mallet, Master. Andre  male   1.00      0
831                  Richards, Master. George Sibley  male   0.83      1
841                         Mudd, Mr. Thomas Charles  male  16.00      0
844                              Culumovic, Mr. Jeso  male  17.00      0
850          Andersson, Master. Sigvard Harald Elias  male   4.00      4
869                  Johnson, Master. Harold Theodor  male   4.00      1

     Parch             Ticket      Fare    Cabin Embarked
7        1             349909   21.0750      NaN        S
16       1             382652   29.1250      NaN        Q
50       1            3101295   39.6875      NaN        S
59       2            CA 2144   46.9000      NaN        S
63       2             347088   27.9000      NaN        S
78       2             248738   29.0000      NaN        S
86       3         W./C. 6608   34.3750      NaN        S
125      0               2651   11.2417      NaN        C
138      0               7534    9.2167      NaN        S
163      0             315093    8.6625      NaN        S
164      1            3101295   39.6875      NaN        S
165      2             363291   20.5250      NaN        S
171      1             382652   29.1250      NaN        Q
182      2             347077   31.3875      NaN        S
183      1             230136   39.0000       F4        S
193      1             230080   26.0000       F2        S
220      0    SOTON/OQ 392089    8.0500      NaN        S
261      2             347077   31.3875      NaN        S
266      1            3101295   39.6875      NaN        S
278      1             382652   29.1250      NaN        Q
282      0             345778    9.5000      NaN        S
305      2             113781  151.5500  C22 C26        S
333      0             345764   18.0000      NaN        S
340      1             230080   26.0000       F2        S
348      1         C.A. 37671   15.9000      NaN        S
352      1               2695    7.2292      NaN        C
386      2            CA 2144   46.9000      NaN        S
407      1              29106   18.7500      NaN        S
433      0  STON/O 2. 3101274    7.1250      NaN        S
445      2              33638   81.8583      A34        S
480      2            CA 2144   46.9000      NaN        S
489      1         C.A. 37671   15.9000      NaN        S
500      0             315086    8.6625      NaN        S
532      1               2690    7.2292      NaN        C
549      1         C.A. 33112   36.7500      NaN        S
550      2              17421  110.8833      C70        C
574      0         A/4. 20589    8.0500      NaN        S
683      2            CA 2144   46.9000      NaN        S
686      1            3101295   39.6875      NaN        S
721      0             350048    7.0542      NaN        S
731      0               2699   18.7875      NaN        C
746      1          C.A. 2673   20.2500      NaN        S
751      1             392096   12.4750     E121        S
755      1             250649   14.5000      NaN        S
764      0             347074    7.7750      NaN        S
787      1             382652   29.1250      NaN        Q
788      2          C.A. 2315   20.5750      NaN        S
791      0             239865   26.0000      NaN        S
802      2             113760  120.0000  B96 B98        S
803      1               2625    8.5167      NaN        C
819      2             347088   27.9000      NaN        S
824      1            3101295   39.6875      NaN        S
827      2    S.C./PARIS 2079   37.0042      NaN        C
831      1              29106   18.7500      NaN        S
841      0        S.O./P.P. 3   10.5000      NaN        S
844      0             315090    8.6625      NaN        S
850      2             347082   31.2750      NaN        S
869      1             347742   11.1333      NaN        S   58

In [31]:
survived = data[data.Survived == 1]['Sex'].value_counts()
print(survived)

female    233
male      109
Name: Sex, dtype: int64

In [32]:
print(data['Fare'].groupby(data['Pclass']).mean())

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [39]:
print(data['Age'].groupby(data['Sex']).mean())

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [40]:
print(data['Age'].median())

28.0

In [42]:
data['Age'].fillna(data['Age'].median(), inplace=True)
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [47]:
print('\nisnull\n', data[data['Embarked'].isnull()])
print('\nvalue_counts\n', data['Embarked'].value_counts())
print('\nidxmax: ', data['Embarked'].value_counts().idxmax())

data['Embarked'].fillna(data['Embarked'].value_counts().idxmax(), inplace=True)
print(data.loc[61])
print(data.loc[829])

isnull
      PassengerId  Survived  Pclass                                       Name  \
61            62         1       1                        Icard, Miss. Amelie
829          830         1       1  Stone, Mrs. George Nelson (Martha Evelyn)

        Sex   Age  SibSp  Parch  Ticket  Fare Cabin Embarked
61   female  38.0      0      0  113572  80.0   B28      NaN
829  female  62.0      0      0  113572  80.0   B28      NaN

value_counts
 S    644
C    168
Q     77
Name: Embarked, dtype: int64

idxmax:  S
PassengerId                     62
Survived                         1
Pclass                           1
Name           Icard, Miss. Amelie
Sex                         female
Age                           38.0
SibSp                            0
Parch                            0
Ticket                      113572
Fare                          80.0
Cabin                          B28
Embarked                         S
Name: 61, dtype: object
PassengerId                                          830
Survived                                               1
Pclass                                                 1
Name           Stone, Mrs. George Nelson (Martha Evelyn)
Sex                                               female
Age                                                 62.0
SibSp                                                  0
Parch                                                  0
Ticket                                            113572
Fare                                                80.0
Cabin                                                B28
Embarked                                               S
Name: 829, dtype: object

In [48]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### Cabin 삭제
#### dropna() : 결측값 삭제
#### axis = 0 결측값이 있는 행 전체 삭제
#### axis = 1 결측값이 있는 열 전체 삭제

In [49]:
data.dropna(axis=1, inplace=True)

In [50]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

### 시각화

In [ ]:
# plot 내장 함수로 차트 생성 (kind='line|bar|bath|hist|pie|scatter')